{"id":1243,"date":"2019-07-01T16:45:38","date_gmt":"2019-07-01T16:45:38","guid":{"rendered":"https:\/\/alkalab.com\/?p=1243"},"modified":"2021-03-26T04:24:53","modified_gmt":"2021-03-26T04:24:53","slug":"gdpr-marketing","status":"publish","type":"post","link":"https:\/\/woffice.io\/gdpr-marketing\/","title":{"rendered":"Is Dynamic Marketing Compliant with GDPR? The Case of GDPR Marketing"},"content":{"rendered":"\n<p>This article is a guest post from the team at Cookiebot. They share their insights into GDPR and how it affects online businesses. This topic is of interest to you, and you have to watch out for this kind of things with your WordPress configuration.&nbsp;<\/p>\n\n\n<p>Enjoy.&nbsp;<\/p>\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n<!--more-->\n\n\n<p>In this post, Cookiebot will clarify the issues between dynamic marketing and GDPR compliance. <\/p>\n\n\n<p>First, we’ll take a look at what exactly <em>dynamic marketing <\/em>is, after which we’ll get into the <em>General Data Protection Regulation<\/em> (GDPR) and what, specifically, it has to say regarding this particular area of interest.&nbsp;<\/p>\n\n\n<p>We’ll look at what <em>consent <\/em>means in the context of this EU law, and ultimately what it means for your prospects of <em>dynamic marketing<\/em>. <\/p>\n\n\n<h2>What is Dynamic Marketing?<\/h2>\n\n\n<p><em>Dynamic marketing<\/em> is the recording of the activity – the comings and goings – of a website visitor and potential customer, and the use of this information for the purpose of optimizing sales. <\/p>\n\n\n<p>It is the tracking of user behavior, potentially down to every click, scroll and hover in order to personalize, push and follow-up on their activity on the website with a targeted advertisement.<\/p>\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/07\/heatmap-1024x702.png\" alt=\"Heatmaps example\" class=\"wp-image-1246\"\/><figcaption>Heatmaps example<\/figcaption><\/figure><\/div>\n\n\n<p>So, dynamic marketing relies on an accumulation of data about each user: how they arrive at a website, what they click on, the speed with which they scroll, where their mouse rests and for how long, what they’ve purchased in the past, whether they look at an offer or not and whether they buy it or not. <\/p>\n\n\n<p>That’s the <em>dynamic<\/em> part. <\/p>\n\n\n<p>The <em>marketing<\/em> part is the persistent, personalized and targeted follow-up by the commercial entity with the effort of trying to persuade the visitor to buy what they’ve expressed interest in.<\/p>\n\n\n<p>Now, all that dynamic<em> <\/em>information is actually <strong>personal data<\/strong>, according to the GDPR.<\/p>\n\n\n<p>But what does that mean and what consequences does it have for dynamic marketers?&nbsp;<\/p>\n\n\n<h2>What is the GDPR?<\/h2>\n\n\n<p>The <em>General Data Protection Regulation <\/em>came into effect on May 25, 2018, and is binding and uniform law in all EU member states. <\/p>\n\n\n<p>Its scope is global in the sense that <em>any <\/em>website in the world who has a visitor from the EU is bound to be compliant with the GDPR or risk fines up to €20 million or 4% of the company’s annual global turnover, whichever is highest.<\/p>\n\n\n<p>So, what does GDPR compliance mean?<\/p>\n\n\n<p>Well first off, <strong>personal data <\/strong>is defined in <strong>Article 4<\/strong> of the GDPR as <em>“any information relating to an identified or identifiable natural person”.&nbsp;<\/em><\/p>\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/07\/article4_gdpr.jpg\" alt=\"Article 4 GDPR\" class=\"wp-image-1247\"\/><\/figure>\n\n\n<p>A user’s online behavior, IP-address, e-mail and other information that can identify them after a visit to a website is therefore personal data under the GDPR, even data that in itself is not personal, but that can identify an individual if accumulated and combined with other data. <\/p>\n\n\n<p>For example for the purpose of targeted marketing.&nbsp;<\/p>\n\n\n<p>This is known as <strong>processing<\/strong> and is defined, also in <strong>Article 4<\/strong>, as “any operation or set of operations which is performed on personal data or on sets of personal data, whether<em> by automated means, such as collection, or not.”<\/em><\/p>\n\n\n<p>What this means is that if a website either directly or by means of third party services records, collects, stores, organizes and\/or uses any of this data for targeted marketing purposes (as you do in <em>dynamic marketing<\/em>), you must first obtain <strong>consent <\/strong>from the user.<\/p>\n\n\n<p>The GDPR unambiguously prohibits any processing of personal data<strong> without the prior consent of the user<\/strong><em> <\/em>(Article 7)<em>.<\/em> <\/p>\n\n\n<p>This means that none of the behavioral data – clicks, scrolls, past purchases, IP-addresses, geo-location, etc. – is allowed to be harvested, stored and used for marketing purposes, or sold, alternatively, to third-party ad tech companies, without the individual giving their consent – their “okay”.<\/p>\n\n\n<p>The GDPR makes it very explicit and pronounced that <em>“consent should be given by a clear affirmative act establishing a freely given, specific, informed and unambiguous indication of the data subject’s agreement to the processing of personal data”<\/em>.<\/p>\n\n\n<p>Last but not least, consent is only real if it can be withdrawn again, and <em>“it shall be as easy to withdraw as to give consent”<\/em>.<\/p>\n\n\n<p>So, how is consent obtained?<\/p>\n\n\n<h2>GDPR Marketing Checklist: How is Consent Obtained Compliantly?<\/h2>\n\n\n<p>Most websites in the world use <em>cookies<\/em> – small text files installed on a user’s device with the purpose of obtaining information about the visitor. <\/p>\n\n\n<p>Some cookies are activated upon arrival on a website, others are activated when a user clicks, scrolls, visits sub-pages and so on.<\/p>\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/07\/alkalab-cookie-1024x527.png\" alt=\"Cookie notice\" class=\"wp-image-1248\"\/><figcaption><em>Example of cookie notice you receive on Alkalab’s website<\/em><br \/><\/figcaption><\/figure>\n\n\n<p>While some cookies are non-intrusive and necessary for the basic functions of the website, other cookies serve analytical and marketing purposes, allowing third-party trackers to collect personal data for behavioral advertisement and many other purposes, some of which are hidden and obscure.<\/p>\n\n\n<p>A website <em>must<\/em>, according to the GDPR, inform their visitors upon arrival of the cookies and other tracking technology present and operating on their website prior to the setting of all cookies but the strictly necessary. This is typically done in a <em>cookie banner<\/em> that pops up on the landing page.&nbsp;<\/p>\n\n\n<p><em>Illegal<\/em> cookie banners are banners that do not provide the visitor with any information on the specific cookies, their function, and purpose, nor enables the visitor to consent to – or opt-out of – any cookies apart from the necessary ones.<\/p>\n\n\n<p><em>Legal <\/em>cookie banners, on the other hand, are banners that explicitly and clearly lists all cookies and all tracking – their function, purpose and operator. <\/p>\n\n\n<p>They enable the visitor to properly consent by giving them the full control of opting out of marketing cookies, if they don’t want their personal data to be used for targeted, behavioral advertisement or shared with unknown third-parties.<\/p>\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/07\/advanced-cookie-notice-1024x532.png\" alt=\"More advanced cookie notice from Cookiebot\n\" class=\"wp-image-1249\"\/><figcaption><em>More advanced cookie notice from Cookiebot<\/em><\/figcaption><\/figure>\n\n\n<p>There’s more! Fully compliant cookie banners <strong>must have marketing cookies deactivated by default<\/strong>, i.e. marketing cookies have to be switched on manually by the visitor before activated by the website. <\/p>\n\n\n<p>This is not the same as the visitor clicking “okay” on a banner, because the banner must have marketing cookies deactivated by default – so <em>if<\/em> the visitor quickly clicks “okay”, then what they are clicking “okay” to is, in fact, the deactivated marketing cookies.<br \/><\/p>\n\n\n<p>Why?&nbsp;<\/p>\n\n\n<p>Well, remember from above that real consent is a <em>“clear and affirmative act”<\/em>. Affirmative is the keyword. <\/p>\n\n\n<p>The visitor must <em>actively <\/em>consent marketing cookies, which means they have to <em>actively, affirmatively<\/em> spend those extra seconds turning the marketing cookies <em>on<\/em>.<\/p>\n\n\n<p>Phew… with us so far?<\/p>\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/07\/cookibot-1024x563.gif\" alt=\"\" class=\"wp-image-1250\"\/><\/figure>\n\n\n<h2>Consensual dynamic marketing?<\/h2>\n\n\n<p>In this post-GDPR world of ours, there is only one scenario of compliant dynamic marketing.&nbsp;<\/p>\n\n\n<p>It is this –&nbsp;<\/p>\n\n\n<p>A visitor lands on a website and is presented with a cookie banner that informs them about all cookies and tracking on the website. <\/p>\n\n\n<p>The visitor spends a couple of seconds glancing over the different cookies. <\/p>\n\n\n<p>Or perhaps they don’t, maybe they suffer from <em>consent fatigue<\/em>, like so many other users, as a result of having been overexposed to non-compliant banners leaving them no true choice but to accept.&nbsp;<\/p>\n\n\n<p>But let’s say, in this scenario, that the user, in fact, <em>does <\/em>choose to activate marketing cookies. <\/p>\n\n\n<p>This means that they consent to have their personal data used for behavioral advertisement. <\/p>\n\n\n<p>In that case, yes, a website owner and company is free to use this data to pursue dynamic marketing towards a visitor with all that that entails.<br \/><\/p>\n\n\n<h2><strong>Is WordPress GDPR Compliant?<\/strong><\/h2>\n\n\n<p>And what about WordPress websites in all of that? Alkalab could not accept an article without talking about WordPress. <\/p>\n\n\n<p>So they have added their part below. <\/p>\n\n\n<p>WordPress core software is GDPR compliant, since WordPress version 4.9.6. <\/p>\n\n\n<p>There has been an integration of several GDPR enhancements by the WordPress development team to make sure that WordPress is GDPR compliant. <\/p>\n\n\n<p>Due to the dynamic nature of most websites, no single platform, extension or solution can provide 100% GDPR compliance. <\/p>\n\n\n<p>The compliance process of GDPR will vary based on the type of website, the type of collected and stored, and the procedure of data processing on the website site.<\/p>\n\n\n<p><strong><em>By default, WordPress now comes with the following GDPR enhancement features:<\/em><\/strong><\/p>\n\n\n<h3><strong>1.&nbsp;Comments Consent<\/strong><\/h3>\n\n\n<p>Formerly WordPress used to store information like <em>commenter&#8217;s<\/em> name, email and website as a cookie on the browser of the user by default and this made it very easy for users to comment on their favorite blogs because those fields were already pre-populated. <\/p>\n\n\n<p>Due to the consent requirement of GDPR, WordPress has integrated the comment consent checkbox which enables the user to leave a comment without checking this box. <\/p>\n\n\n<p>This means that they would have to enter their name, email, and website manually every time they leave a comment.<\/p>\n\n\n<h3><strong>2. Data Export and Erase Feature<\/strong><\/h3>\n\n\n<p>WordPress provides website owners with the ability to comply with the data handling requirements of GDPR and honor the request of users for exporting personal data and removal of the user’s personal data. <\/p>\n\n\n<p>The data handling features of GDPR can be found under the <em>Tools<\/em> menu inside WordPress&#8217; admin dashboard.<\/p>\n\n\n<h3><strong>3. Privacy Policy Generator<\/strong><\/h3>\n\n\n<p>WordPress now comes with an inbuilt privacy policy generator features, to provide a pre-made privacy policy template.<\/p>\n\n\n<p>This makes it easy for the website owner to be transparent with the users as regarding the type of data acquired, stored and how the data is used.<\/p>\n\n\n<p><strong>Pro Tip: Use a cookie manager plugin on your website. Guess what? <a href=\"http:\/\/cookiebot.com\/\" target=\"_blank\" rel=\"noopener\">Cookiebot<\/a> has a WordPress plugin available for free on WordPress.org.<\/strong><\/p>\n\n\n<figure class=\"wp-block-embed-wordpress aligncenter wp-block-embed is-type-wp-embed is-provider-plugin-directory\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"wp-embedded-content\" data-secret=\"KruJJ1MSeQ\"><a href=\"https:\/\/wordpress.org\/plugins\/cookiebot\/\" target=\"_blank\" rel=\"noopener\">Cookiebot | GDPR\/CCPA Compliant Cookie Consent and Control<\/a><\/blockquote><iframe class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" style=\"position: absolute; clip: rect(1px, 1px, 1px, 1px);\" title=\"&#8220;Cookiebot | GDPR\/CCPA Compliant Cookie Consent and Control&#8221; &#8212; Plugin Directory\" src=\"https:\/\/wordpress.org\/plugins\/cookiebot\/embed\/#?secret=KruJJ1MSeQ\" data-secret=\"KruJJ1MSeQ\" width=\"500\" height=\"282\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"><\/iframe>\n<\/div><\/figure>\n\n\n<h2>Conclusion: How to Get GDPR Compliant Dynamic Marketing?<\/h2>\n\n\n<p>In order to continue using dynamic marketing in compliance with the GDPR, your website needs to obtain prior consent from the user, i.e. that the user activates your website’s marketing cookies.&nbsp;<\/p>\n\n\n<p>According to the GDPR, the control of a user’s personal data must be in the hands of the user themselves.&nbsp;<\/p>\n\n\n<p>So if you want to continue exercising dynamic marketing on your website, your task is to persuade your visitors to opt-in for the marketing cookies. <\/p>\n\n\n<p>You’ll have to tell them why it’s a good idea, what you can offer, how their experience of your site and your products will be enhanced by this opt-in.<\/p>\n\n\n<p>In this post-GDPR world, the currency of transparency and privacy is worth more and more in the context of marketing.<\/p>\n\n\n<p>As your customers become more informed and critical users, they will also expect and demand autonomy and security in how their data is handled online.<\/p>\n\n\n<p>The balance to be struck for websites doing dynamic marketing now is to be totally GDPR compliant while offering safe and privacy-respecting advertisement options that can persuade users to activate those marketing cookies.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This article is a guest post from the team at Cookiebot. They share their insights into GDPR and how it affects online businesses. This topic is of interest to you, and you have to watch out for this kind of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1245,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/1243"}],"collection":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/comments?post=1243"}],"version-history":[{"count":1,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/1243\/revisions"}],"predecessor-version":[{"id":5653,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/1243\/revisions\/5653"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/media\/1245"}],"wp:attachment":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/media?parent=1243"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/categories?post=1243"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/tags?post=1243"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}