{"id":1259,"date":"2019-08-12T19:29:55","date_gmt":"2019-08-12T19:29:55","guid":{"rendered":"https:\/\/alkalab.com\/?p=1259"},"modified":"2021-03-26T04:24:53","modified_gmt":"2021-03-26T04:24:53","slug":"wordpress-admin-panel-tutorial","status":"publish","type":"post","link":"https:\/\/woffice.io\/wordpress-admin-panel-tutorial\/","title":{"rendered":"A Beginner&#8217;s Guide: WordPress Admin Panel Tutorial"},"content":{"rendered":"<p><\/p>\r\n<p><a href=\"https:\/\/wordpress.org\" target=\"_blank\" rel=\"noopener\">WordPress<\/a> is a user-friendly CMS that even the first-timers who have never seen any WordPress Admin Panel tutorial before choosing it to power their projects. This is no small measure of the success of the CMS in a highly competitive market that sees new CMS enter very regularly. <\/p>\r\n<p><br \/><\/p>\r\n<p>WordPress is renowned for its simplicity and easy-to-use interface. The <a href=\"https:\/\/www.wpblog.com\/beginners-overview-of-wordpress-admin-panel-toolbar\/\" target=\"_blank\" rel=\"noopener\">WordPress Admin Dashboard<\/a> allows users to manage their websites easily without writing a single line of code. <\/p>\r\n<p><br \/><\/p>\r\n<p>In this article, I will explain how to use the admin dashboard and describe each section in detail. <\/p>\r\n<p><br \/><br \/><!--more--><br \/><br \/><\/p>\r\n<h2>1. WordPress Installation and WordPress Login Page<\/h2>\r\n<p><br \/><\/p>\r\n<p>In a standard installation, you access the WordPress admin dashboard from the address:<\/p>\r\n<p><br \/><\/p>\r\n<pre class=\"wp-block-code\"><code>https:\/\/yoursite.com\/wp-admin<\/code><\/pre>\r\n<p><br \/><\/p>\r\n<p>However, it is possible to install WordPress in a directory other than root. In this case, the admin dashboard is accessible from the subfolder address:<\/p>\r\n<p><br \/><\/p>\r\n<pre class=\"wp-block-code\"><code>https:\/\/yoursite.com\/wordpress\/wp-admin<\/code><\/pre>\r\n<p><br \/><\/p>\r\n<p>When you open your WordPress login page, you have the option of entering your credentials to log into the website. At the end of the page, you have the option of recovering your password and see your website’s URL.<\/p>\r\n<p><br \/><\/p>\r\n<div class=\"wp-block-image\">\r\n<figure class=\"aligncenter\"><img class=\"wp-image-1267\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image3.png\" alt=\"WordPress admin panel login page\" \/><\/figure>\r\n<\/div>\r\n<p><br \/><\/p>\r\n<h2>2. WordPress Dashboard<\/h2>\r\n<p><br \/><\/p>\r\n<p>WordPress Dashboard is the nucleus of a website using WordPress. An admin has full access to all sections of WordPress.<\/p>\r\n<p><br \/><\/p>\r\n<p>Users with other roles, such as Publisher, Contributor, or Author, have limited access to the admin area. Some roles such as Subscribers only have access to their profile page. <\/p>\r\n<p><br \/><\/p>\r\n<p>On the dashboard, each main section has a submenu that displays additional options (I’ll discuss them in the Admin Menu section).<\/p>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1268\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image8.png\" alt=\"WordPress dashboard overview\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>Let’s look at each section of the WordPress Dashboard in detail.<\/p>\r\n<p><br \/><\/p>\r\n<ol>\r\n<li><strong>Dashboard:<\/strong> offers immediate access to all sections, such as the Dashboard, Articles, Media, Pages, Comments, Appearance, Plugins, Users, Tools, and Settings<\/li>\r\n<li><strong>Toolbar: <\/strong>allows quick access to the account, website URL, comments, etc.<\/li>\r\n<li><strong>Screen Options:<\/strong> allows you to change what is shown in the admin panel<\/li>\r\n<li><strong>Help:<\/strong> show suggestions for the section you are viewing<\/li>\r\n<li><strong>Customize Your Site:<\/strong> allows you to customize the front-end elements of your WordPress<\/li>\r\n<li><strong>At a Glance:<\/strong> provides details such as the number of articles and pages published, categories and tags used, number of comments left by users. It also shows the active theme, the number of widgets added to the front-end and the current WordPress version.<\/li>\r\n<li><strong>Quick Draft:<\/strong> allows you to quickly write an article on the blog.<\/li>\r\n<li><strong>Activity:<\/strong> shows you the recent activity performed on your WordPress website.<\/li>\r\n<li><strong>Recent Comments:<\/strong> shows the latest comments that users have left on the blog. You can approve, reply, delete, modify or mark the comment as spam directly from here.<\/li>\r\n<li><strong>WordPress Events and News:<\/strong> Links that lead to WordPress events particularly WordCamps <\/li>\r\n<li><strong>WordPress Version:<\/strong> shows the current version of WordPress.<\/li>\r\n<\/ol>\r\n<p><br \/><\/p>\r\n<h2>2.1. Toolbar<\/h2>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1269\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image2.png\" alt=\"\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>From the toolbar, you can access different sections of the admin panel. It also allows you to move directly to the creation of a new post or page.<\/p>\r\n<p><br \/><\/p>\r\n<p>A small balloon icon displays the number of comments awaiting moderation. Similarly, you can see if any updates are available for the WordPress core, themes, and plugins.<\/p>\r\n<p><br \/><\/p>\r\n<p>Near the end, you can see the name of the active users and the option to log out of the admin panel. <\/p>\r\n<p><br \/><\/p>\r\n<ol>\r\n<li><strong>WordPress Logo:<\/strong> leads to the official documentation and the website. <\/li>\r\n<li><strong>Home Button:<\/strong> points to the homepage of the website.<\/li>\r\n<li><strong>Website URL:<\/strong> shows the URL of the website.<\/li>\r\n<li><strong>Comments:<\/strong> shows the number of recent comments and leads to the Comments page.<\/li>\r\n<li><strong>New:<\/strong> shows a submenu that you can use to create posts and pages. <\/li>\r\n<li><strong>Account:<\/strong> shows information about the current user and links to the profile and logout page.<\/li>\r\n<\/ol>\r\n<p><br \/><\/p>\r\n<h2>2.2. Admin Menu<\/h2>\r\n<p><br \/><\/p>\r\n<p>The WordPress Admin Panel consists of several sections, each with specific features. The left column is the admin menu. This is a two-level menu where the upper-level element often groups similar options\/pages.<\/p>\r\n<p><br \/><\/p>\r\n<p>The central area of the main page is called Dashboard and contains a series of widgets that provide quick access to the most commonly used functions\/features.<\/p>\r\n<p><br \/><\/p>\r\n<h3>Dashboard<\/h3>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1270\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image4.png\" alt=\"\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>The first group of elements of the admin menu contains the items, &#8220;Articles&#8221;, &#8220;Media&#8221;, &#8220;Pages&#8221; and &#8220;Comments&#8221;.<\/p>\r\n<p><br \/><\/p>\r\n<p>From the Dashboard, you can access &#8220;Updates&#8221;, where you can manage all the updates of the installation, from the CMS version to the installed plugins and themes.<\/p>\r\n<p><br \/><\/p>\r\n<ol>\r\n<li><strong>Home:<\/strong> by default, the main dashboard area displays a general overview of your website and activity, as well as information about upcoming WordPress events and news.<\/li>\r\n<li><strong>Updates:<\/strong> displays the latest updates available for your WordPress, plugins, and themes.<\/li>\r\n<\/ol>\r\n<p><br \/><\/p>\r\n<h3>Posts<\/h3>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1271\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image7.png\" alt=\"\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>One of the many benefits of the WordPress admin page is that it is extremely easy to publish new pages or articles. In this section, you can choose which posts to show (All, Published, Draft, and Trash).<\/p>\r\n<p><br \/><\/p>\r\n<p>Moving the mouse over the article name will show the links to manage the articles.<\/p>\r\n<p><br \/><\/p>\r\n<ol>\r\n<li><strong>All Posts:<\/strong> you can see all your content pages or blogs (Publish, Draft, Trash).<\/li>\r\n<li><strong>Add New:<\/strong> to create a new blog, click the Add New button from this section.<\/li>\r\n<li><strong>Categories:<\/strong> choose from the most used labels or add a new one. <\/li>\r\n<li><strong>Tags:<\/strong> choose from the most used tags or add a new one for your posts.<\/li>\r\n<\/ol>\r\n<p><br \/><\/p>\r\n<h3>Media<\/h3>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1272\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image5.png\" alt=\"\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>Your WordPress Admin page provides you with media management, displaying your media library (images, documents, and files).<\/p>\r\n<p><br \/><\/p>\r\n<p>In this section, you can manage images and files. Hover over the media files and you can see the options for modifying, deleting or viewing the media files. <\/p>\r\n<p><br \/><\/p>\r\n<ol>\r\n<li><strong>Library:<\/strong> You can manage all the image-related information including the alternative text for better SEO. On a side note, for better SEO management, I’d recommend you to install <a href=\"https:\/\/yoast.com\/wordpress\/plugins\/seo\/\" target=\"_blank\" rel=\"noopener\">Yoast<\/a>.<\/li>\r\n<li><strong>Add New:<\/strong> You can upload new media files for your pages and posts, individually or in bulk.<\/li>\r\n<\/ol>\r\n<p><br \/><\/p>\r\n<h3>Pages<\/h3>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1273\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image4-1.png\" alt=\"\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>Pages are ideal for static content, although you can edit or update them whenever you want. In this section, you can manage and view WordPress pages.<\/p>\r\n<p><br \/><\/p>\r\n<p>By hovering the mouse over the page title, you can manage different aspects such as.<\/p>\r\n<p><br \/><\/p>\r\n<ol>\r\n<li><strong>All Pages:<\/strong> to see the pages of your website right now, choose all the pages in the navigation section.<\/li>\r\n<li><strong>Add New:<\/strong> adding a new page is very similar to adding a new blog, except you do not have the option to use categories.<\/li>\r\n<\/ol>\r\n<p><br \/><\/p>\r\n<h3>Comments<\/h3>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1274\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image1.png\" alt=\"\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>In this section, you can manage and view all comments on the website. The comments to be approved are highlighted in yellow and hovering over a comment, you can approve (or mark it as spam.<\/p>\r\n<p><br \/><\/p>\r\n<p>You can also reply to the comments or simply delete them. <\/p>\r\n<p><br \/><\/p>\r\n<h3>Appearance<\/h3>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1275\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image6.png\" alt=\"WordPress theme\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>From this section, you can manage the visual aspects of your site.<\/p>\r\n<p><br \/><\/p>\r\n<p>From the main screen, it is possible to manage and change the <a href=\"https:\/\/alkalab.com\/blog\/wordpress-intranet-themes\/\" target=\"_blank\" rel=\"noopener\">WordPress theme<\/a>, search for and install new themes from the official WordPress theme repository or popular third-party developers\/marketplaces, such as Themeforest, where we sell our successful WordPress intranet theme <a href=\"https:\/\/woffice.io\/\">woffice.io<\/a>.<\/p>\r\n<p><br \/><\/p>\r\n<ol>\r\n<li><strong>Theme:<\/strong> you can install free themes, or upload new themes by hitting the Add New button.<\/li>\r\n<li><strong>Customize:<\/strong> this section allows you to manage themes and customize the design of your website.<\/li>\r\n<li><strong>Widgets:<\/strong> Add widgets to display customized data at selected locations on the website frontend. <\/li>\r\n<li><strong>Menus:<\/strong> You can create personalized menus.<\/li>\r\n<li><strong>Theme Editor:<\/strong> You can directly edit the HTML\/CSS of your theme files.<\/li>\r\n<\/ol>\r\n<p><br \/><\/p>\r\n<h3>Plugins<\/h3>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1276\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image9.png\" alt=\"\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>From the Plugins section, you can view all installed <a href=\"https:\/\/alkalab.com\/blog\/tutorial-wordpress-plugin-web-app\/\" target=\"_blank\" rel=\"noopener\">plugins<\/a>, active, inactive plugins.<\/p>\r\n<p><br \/><\/p>\r\n<p>You can activate\/deactivate any plugin, modify it or discard it. To add a new plugin, just click the “Add New” button, enter the name of the plugin you are looking for,  and click Install.<\/p>\r\n<p><br \/><\/p>\r\n<ol>\r\n<li><strong>Installed Plugins: <\/strong>check the number and details of the active\/inactive installed plugins. In addition, you can activate, deactivate, update, and delete plugins in bulk.<\/li>\r\n<li><strong>Add New: <\/strong>you can upload, search or add featured, popular, and recommended plugins directly from WordPress Plugins Repository. <\/li>\r\n<li><strong>Plugin Editor: <\/strong>edit the source code of the installed plugin(s) from the backend or manually upload the plugin file.<\/li>\r\n<\/ol>\r\n<p><br \/><\/p>\r\n<h3>Users<\/h3>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1277\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image13.png\" alt=\"\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>Shows registered users of the website and what roles they have. You can see the username, name, email, role, and number of items that the user has published on your website.<\/p>\r\n<p><br \/><\/p>\r\n<p>To add a new user manually, click on the “Add New” button and fill in all the fields. <\/p>\r\n<p><br \/><\/p>\r\n<ol>\r\n<li><strong>All Users:<\/strong> see all the users and their usernames, emails, and roles. You can also modify their levels of admin access.<\/li>\r\n<li><strong>Add New:<\/strong> add new users and their access level for your website.<\/li>\r\n<li><strong>Your Profile:<\/strong> a user can customize the display profile, public name,  bio, email address, contact info, etc.<\/li>\r\n<\/ol>\r\n<p><br \/><\/p>\r\n<h3>Tools<\/h3>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1278\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image10.png\" alt=\"\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>WordPress offers different tools to help you import articles and media from WordPress or from other platforms (Blogger, Tumblr).<\/p>\r\n<p><br \/><\/p>\r\n<p>It also allows the export of its content to create backups.<\/p>\r\n<p><br \/><\/p>\r\n<ol>\r\n<li><strong>Available Tools:<\/strong> You can see existing categories and tags in this section.<\/li>\r\n<li><strong>Import:<\/strong> allows you to import data from other platforms or just XML files.<\/li>\r\n<li><strong>Export:<\/strong> export the content of the blog, which can then be imported to another website.<\/li>\r\n<li><strong>Site Health:<\/strong> provides you a detailed analysis of your website performance and recommends improvements.<\/li>\r\n<li><strong>Export Personal Data:<\/strong> users can export their personal data in a zip file that exists within a WordPress website.<\/li>\r\n<li><strong>Erase Personal Data:<\/strong> users can remove their data from the WordPress database. Note that once your data is removed, it cannot be reversed back.<\/li>\r\n<\/ol>\r\n<p><br \/><\/p>\r\n<h3>Settings<\/h3>\r\n<p><br \/><\/p>\r\n<figure class=\"wp-block-image\"><img class=\"wp-image-1279\" src=\"https:\/\/alkalab.com\/wp\/wp-content\/uploads\/2019\/08\/image12.png\" alt=\"\" \/><\/figure>\r\n<p><br \/><\/p>\r\n<p>This is where you can make large-scale changes to your entire website. The “Settings” menu provides a series of admin pages that allow you to configure various site features.<\/p>\r\n<p><br \/><\/p>\r\n<p>The default menu structure is as follows.<\/p>\r\n<p><br \/><\/p>\r\n<ol>\r\n<li><strong>General:<\/strong> You can change the title and tagline as well as the address of your website (URL). Other settings include email address and time\/date format.<\/li>\r\n<li><strong>Writing:<\/strong> You can choose the default category, the format of your articles and create an article using an email client.<\/li>\r\n<li><strong>Reading:<\/strong> You can choose the number of articles that you want to display on the pages, the same principle for syndication feeds. Make your website accessible to search engines, such as Google.<\/li>\r\n<li><strong>Discussion:<\/strong> You can control comments in your comments or completely disable them. You can also choose from a list of avatar providers that displays an image for authors next to their comments.<\/li>\r\n<li><strong>Media:<\/strong> Lets you choose the size of your images when you insert them into your blog posts or web pages.<\/li>\r\n<li><strong>Permalinks:<\/strong> You can choose the link structure for all your articles, pages, categories and tags since the link structure is very important.<\/li>\r\n<li><strong>Privacy:<\/strong> This is a privacy policy page. You can use the existing page or create a new page.<\/li>\r\n<\/ol>\r\n<p><br \/><\/p>\r\n<p>This list of pages is just the default structure, as the plugins and the active theme can add pages with additional functionality compared to a basic installation.<\/p>\r\n<p><br \/><\/p>\r\n<p>Besides, the WordPress API allows developers to add new settings to existing pages.<\/p>\r\n<p><br \/><\/p>\r\n<h2>3. Wrapping Up<\/h2>\r\n<p><br \/><\/p>\r\n<p>Using WordPress is really simple, it will take you a few days to discover the main features and up your WordPress admin panel game!<\/p>\r\n<p><br \/><\/p>\r\n<p>If you are new with WordPress, my advice is to install it on a <a href=\"https:\/\/www.cloudways.com\/en\/wordpress-cloud-hosting.php\" target=\"_blank\" rel=\"noopener\">managed WordPress hosting<\/a> service, so you don’t have to worry about server management, security settings, backups, etc.<\/p>\r\n<p><br \/><\/p>\r\n<p>If you have any queries related to this article or WordPress in general, feel free to write them in the comments section below.<\/p>\r\n<p><\/p>","protected":false},"excerpt":{"rendered":"<p>WordPress is a user-friendly CMS that even the first-timers who have never seen any WordPress Admin Panel tutorial before choosing it to power their projects. This is no small measure of the success of the CMS in a highly competitive [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1265,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"_links":{"self":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/1259"}],"collection":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/comments?post=1259"}],"version-history":[{"count":2,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/1259\/revisions"}],"predecessor-version":[{"id":5071,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/1259\/revisions\/5071"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/media\/1265"}],"wp:attachment":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/media?parent=1259"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/categories?post=1259"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/tags?post=1259"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}