{"id":311,"date":"2015-11-20T00:00:05","date_gmt":"2015-11-20T00:00:05","guid":{"rendered":"https:\/\/alka-web.com\/wp\/?p=43"},"modified":"2021-03-26T04:25:06","modified_gmt":"2021-03-26T04:25:06","slug":"create-a-paid-memberships-area-on-your-wordpress-website","status":"publish","type":"post","link":"https:\/\/woffice.io\/create-a-paid-memberships-area-on-your-wordpress-website\/","title":{"rendered":"Create a paid memberships area on your WordPress site"},"content":{"rendered":"<p>In this article you will learn how to create restricted and membership areas on your WordPress website. To achieve this we will use <strong>Paid Memberships Pro<\/strong>, the best plugin to manage paid membership levels and add restricted contents, available only for a fee, to your website.<br \/>\nIf you want to create paid contents for your community or e-learning, this is the article for you.<br \/>\nIn addition, we will show you <a href=\"http:\/\/themeforest.net\/item\/woffice-intranetextranet-wordpress-theme\/11671924?ref=alkaweb\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Woffice <\/a>– a WordPress theme designed for communities, e-learning and intranets\/extranets. It is totally compatible with Paid Memberships Pro and adds more features to it.<!--more--><\/p>\n<h2>Quick overview on Paid Memberships Pro<\/h2>\n<p><a href=\"http:\/\/www.paidmembershipspro.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Paid Memberships Pro<\/a> is the best WordPress plugin to manage <strong>paid memberships<\/strong> for your website. It is suitable for professional organisations with thousands of members, e-learning and selling online courses, accepting payments for on-demand videos.<br \/>\nYou will be able to manage registration payments, recurring payments, expiration dates and much more.<br \/>\nPaid Memberships Pro has a <strong>free version<\/strong>, which already contains a lot of features that will allow you to manage membership areas on your WordPress website. Two premium versions, in turn, will provide you much more features, themes, premium support, access to the community forum.<br \/>\nThe plugin is compatible with many payment gateways: PayPal, Stripe, Authorize.net, Braintree, 2Checkout, CyberSource. From version 1.8 onwards, the authors provided a way to add new payment gateways without editing the core files.<\/p>\n<h2>Initial settings<\/h2>\n<p>First, download, install and activate Paid Memberships Pro on your website. You can download it from your WordPress dashboard.<br \/>\nAfter that, go to the dashboard of the plugin, select <em>Membership Levels<\/em>, and click the <em>Add New Level<\/em> button.<br \/>\n<img loading=\"lazy\" class=\"alignnone wp-image-45 size-full\" src=\"https:\/\/alka-web.com\/wp\/wp-content\/uploads\/2015\/11\/Paid-Membership-Pro-fields.jpg\" alt=\"Create a new membership level\" width=\"1365\" height=\"621\" \/><br \/>\nThe fields displayed to you are:<\/p>\n<ul>\n<li><strong>Name:<\/strong> The name of the membership level. It is used in the frontend, your users will pay for it, so take your time to choose it.<\/li>\n<li><strong>Description:<\/strong> Optional content shown on the checkout page.<\/li>\n<li><strong>Confirmation Message:<\/strong> Optional content shown on the checkout confirmation page.<\/li>\n<li><strong>Billing Details:<\/strong> All information about payment. You can set one-time or recurring payments, expiration time, free trial, etc.<\/li>\n<li><strong>Content Settings:<\/strong> Here, there is a list of all categories and taxonomies of your site. Any post in a restricted category will be available only for the members of this level.<\/li>\n<\/ul>\n<p>Now that we have created our first membership level, we have to generate some pages required for the proper functioning of Paid Memberships Pro (such as WooCommerce pages).<br \/>\nOpen the <em>Pages<\/em> tab. If this is the first time you use the plugin, and you don’t know how those pages work, I advise you to click “<em>Let us generate them for you<\/em>” – this way all pages will be generated automatically, and you will not have to do anything more.<\/p>\n<h2>Set up a gateway payment and SSL<\/h2>\n<p>Now we have to set up the way to receive our payments. So, open the <em>Payment Gateway &amp; SSL<\/em> tab.<br \/>\nFirst, select the payment method that you prefer from the dropdown list. After that, select your environment:<\/p>\n<ul>\n<li><strong>Sandbox\/Testing: <\/strong>It means that you will do your test in a sandbox, using fake accounts and fake money. If you use PayPal for your payments, you can configure your sandbox account using <a href=\"https:\/\/developer.paypal.com\/developer\/accounts\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">PayPal Developer<\/a>.<\/li>\n<li><strong>Live\/Production:<\/strong> Set this when you are ready to receive real money from real users.<\/li>\n<\/ul>\n<p>Now you have to set up gateway settings. Each gateway needs different information to be set. If you don’t know where to find the information that you need, visit the <a href=\"http:\/\/www.paidmembershipspro.com\/gateway\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">gateway page<\/a> of plugin documentation.<br \/>\nAfter that, set your currency and tax percentage, and, finally, set your SSL information, if you need it. An SSL Certificate is required only if you don’t use an external gateway method (such as PayPal). If you want to know more about the SSL Certificate, you can read <a href=\"http:\/\/www.paidmembershipspro.com\/documentation\/initial-plugin-setup\/ssl\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">this<\/a> article.<br \/>\nAfter you have set your payment gateway, you should check the <em>Email <\/em>tab – to make sure that you will receive all the notifications that you want and at the right email address.<\/p>\n<h2>Set paid access for WordPress pages<\/h2>\n<p>You can also set a <strong>paid access for a single page<\/strong> also, instead of a blog section.<br \/>\nOpen a WordPress dashboard and select a page that you want to lock. In the right sidebar, you will find the <em>Require Membership<\/em> box.<br \/>\n<img loading=\"lazy\" class=\"wp-image-46 size-full aligncenter\" src=\"https:\/\/alka-web.com\/wp\/wp-content\/uploads\/2015\/11\/Paid-Membership-Pro-pages-settings.jpg\" alt=\"Page membership settings\" width=\"291\" height=\"129\" \/><br \/>\nIn this box, you will find all membership levels that you have created. If you check one or more of them, only that membership level will have access to the current page.<br \/>\nNow you can visit the pages or the blog sections locked and see that the plugin alerts you that you can access this content only if you have paid for the right membership level and logged in with it.<\/p>\n<h2>Manage user permissions<\/h2>\n<p>Of course, you can also assign a membership level to a user manually. You can do this when you want to give your contents as a gift to one of your users, correct some mistake of yours or of your users, or, more likely, allow your account to see locked content in the frontend.<br \/>\nIf you go to the WordPress user page, you will see a new column in the listing.<br \/>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-44\" src=\"https:\/\/alka-web.com\/wp\/wp-content\/uploads\/2015\/11\/Paid-Membership-Pro-users-settings.jpg\" alt=\"Membership user settings\" width=\"1190\" height=\"345\" \/><br \/>\nIn the single user settings, you will be able to manage the membership level and expiration.<\/p>\n<h2>Woffice: the best theme to create your community or e-learning website<\/h2>\n<p>If you want to create your community or e-learning platform, you will fall in love with the Woffice theme.<br \/>\nThis WordPress theme is designed for community websites, online schools, online courses, intranets and extranets.<br \/>\nIt contains hundreds of features that will allow you to create your website with little effort and save you a lot of time and money – because Woffice contains some premium plugins for free!<br \/>\nIf this is not enough, you have to know that Woffice has been developed by the author of ThemeForest Elite, who provides a wonderful support service. There are already more than 1300 happy customers and more than 55 five-star reviews.<br \/>\nWoffice is flexible enough to be suitable for all purposes. It is compatible with a large number of free and premium plugins and is periodically updated.<br \/>\nHave a look at the complete list of <a href=\"http:\/\/themeforest.net\/item\/woffice-intranetextranet-wordpress-theme\/11671924?ref=alkaweb\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Woffice features<\/a>. If you have some presale questions, feel free to open a ticket <a href=\"https:\/\/2f.ticksy.com\/submit\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">here<\/a>, you will receive a reply in less than 24 hours.<br \/>\n&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this article you will learn how to create restricted and membership areas on your WordPress website. To achieve this we will use Paid Memberships Pro, the best plugin to manage paid membership levels and add restricted contents, available only for [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":59,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"_links":{"self":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/311"}],"collection":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/comments?post=311"}],"version-history":[{"count":1,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/311\/revisions"}],"predecessor-version":[{"id":5686,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/311\/revisions\/5686"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/media\/59"}],"wp:attachment":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/media?parent=311"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/categories?post=311"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/tags?post=311"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}