{"id":327,"date":"2016-12-12T13:43:09","date_gmt":"2016-12-12T13:43:09","guid":{"rendered":"http:\/\/alka-web.com\/alka-web-com\/?p=327"},"modified":"2021-03-26T04:25:06","modified_gmt":"2021-03-26T04:25:06","slug":"customers-stories-1-consulting-in-the-area-of-digital-communication","status":"publish","type":"post","link":"https:\/\/woffice.io\/customers-stories-1-consulting-in-the-area-of-digital-communication\/","title":{"rendered":"Customer Stories #1: Consulting in the area of digital communication"},"content":{"rendered":"<p>As you can see from the ThemeForest page, at the current moment, Woffice counts more than 4200 sales. But we believe even more that the number of the sales it&#8217;s not just a figure, it&#8217;s our customers, real people with real stories. Who have chosen Woffice to achieve their real goals. For this reason we realized that we would love to get more details about our customers and see what they think about Alkaweb and Woffice, so we&#8217;ve decided to collect some of these customer stories and share them with you, with a set of articles entirely dedicated to our customers.<br \/>\n<!--more--><br \/>\nWe lunched this new set with this first article, dedicated to <strong>Renan Santiago<\/strong>, a guy that used Woffice to improve his business, consulting in the area of digital communication and TV, but let&#8217;s stop to write and see what Renan have to say.<\/p>\n<h2>1. Hi Renan, please present yourself<\/h2>\n<p>My name is Renan Santiago and I&#8217;m 24 years old. I live in São Paulo, Brazil and started working when I was 14 years old helping the internet company that my mother used to work to achieve good visual communication in Salvador, about 2000 kilometers from São Paulo. I graduated in Computer Management in 2010 and Graphic Design in 2012. My whole life I have always loved the internet and its ability to unite people (when used correctly, haha).<br \/>\nToday I own a company called Santiago.media, where we do business consulting in the area of digital communication and TV. We have several clients from different segments, such as commodities, celebrities, TV channels and companies. A few months ago one of our customers asked us for an easy-to-manage platform to use with their representatives and their employees across Brazil, a place with over 200 million people.<\/p>\n<h2>2. Why have you chosen Woffice to build your application?<\/h2>\n<p>After much research, I realized that it was the tool that best suited my client&#8217;s needs. A complete tool, easy to manage and with impressive support. In addition I&#8217;m more familiar with WordPress, With this platform we managed to solve problems in an easy way and with a bundle of plugins we managed to make it much safer!<\/p>\n<h2>3. Have you found in Woffice what you were looking for?<\/h2>\n<p>Yes. The tasking management tool was crucial to decide. Also, the buddypress integration is awesome. I really like the fact that Woffice is responsive and it&#8217;s beautiful design.<\/p>\n<h2>4. What is the top number one feature in Woffice that you definitely prefer and that helped you during your development, more than any other one?<\/h2>\n<p>It has so much features that can&#8217;t decide the best, but I think that the support team helped me A LOT and made me see that Alkaweb isn&#8217;t like the others. It&#8217;s easy to see how they care for the customers and do their best to every client. (thanks Antonio!)<\/p>\n<h2>5. Is Woffice easy enough to use for a beginner?<\/h2>\n<p>Yes, the documentation is very well explained and anyone with a simple knowledge of internet can use Woffice. And the best thing is to count on the Support Team to take your questions and assist you in any way.<\/p>\n<h2>6. What is the most useful plugin for your application?<\/h2>\n<p>The Buddypress integration and the File Away will help us A LOT!<\/p>\n<h2><\/h2>\n<h2>7. There is something that you would say to Alkaweb team or to the future Woffice customers?<\/h2>\n<p>You can count on them. The platform is a success because I&#8217;m sure the team has thought of every detail to satisfy customers from all over the world. I&#8217;m glad to hear that there are companies that take care of customers this way. Thank you, guys!<\/p>\n<h2>Conclusion<\/h2>\n<p>Here&#8217;s Antonio again. I would say thank you so much to Renan to have chosen Woffice and have shared his story. Alkaweb wishes him all the best!<br \/>\nIf you have already used Woffice for your business (or if you are still using it) and you would like to share your story, feel free to <a href=\"http:\/\/alka-web.com\/alka-web-com\/contact\/\" target=\"_blank\" rel=\"noopener\">contact us<\/a>.<br \/>\nLast but not least, I really hope you will like this idea of customers stories, let me know what you think about it in the comments section underneath.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As you can see from the ThemeForest page, at the current moment, Woffice counts more than 4200 sales. But we believe even more that the number of the sales it&#8217;s not just a figure, it&#8217;s our customers, real people with [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":332,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7,13],"tags":[12],"_links":{"self":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/327"}],"collection":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/comments?post=327"}],"version-history":[{"count":1,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/327\/revisions"}],"predecessor-version":[{"id":5675,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/327\/revisions\/5675"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/media\/332"}],"wp:attachment":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/media?parent=327"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/categories?post=327"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/tags?post=327"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}