{"id":349,"date":"2017-01-30T12:05:00","date_gmt":"2017-01-30T12:05:00","guid":{"rendered":"http:\/\/alka-web.com\/alka-web-com\/?p=349"},"modified":"2021-03-26T04:25:06","modified_gmt":"2021-03-26T04:25:06","slug":"customer-stories-2-woffice-from-the-point-of-view-of-an-international-speaker","status":"publish","type":"post","link":"https:\/\/woffice.io\/customer-stories-2-woffice-from-the-point-of-view-of-an-international-speaker\/","title":{"rendered":"Customer Stories #2: Woffice from the point of view of an international speaker"},"content":{"rendered":"<p>Finally, we have a second story for our set of customer stories (if you missed the first one, you can find it <a href=\"http:\/\/alka-web.com\/alka-web-com\/customers-stories-1-consulting-in-the-area-of-digital-communication\/\" target=\"_blank\" rel=\"noopener\">here<\/a>). This time is the turn of Edward A. Rodriguez, an entrepreneur from Florida (USA)<em>. <\/em>Edward is an international speaker and coach in the self-empowerment business. He helped thousands of people to change their lives and to improve their results.<br \/>\nIn this article you will discover how  Woffice has helped him and his business.<\/p>\n<h2>1. Hi Edward, can you talk us about yourself and your business?<\/h2>\n<p>My name is Edward, Transformational Trainer, Life Coach, Author and founder of the In-powerment Center.<br \/>\nOur main website is <a href=\"https:\/\/edwardrodriguez.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">www.EdwardRodriguez.com<\/a> and our members site: <a href=\"http:\/\/miembros.edwardrodriguez.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">miembros.edwardrodriguez.com<\/a><br \/>\nIn an effort to reduce my traveling and at the same time satisfy our growing international demand for our transformational programs (personal development, time management, personal leadership, public speaking, sales etc), we decided to create a membership site to deliver our digital program and courses.<\/p>\n<h2>2. Why have you chosen Woffice to build your application?<\/h2>\n<p>On one occasion I saw a colleague of mine using Woffice and I liked it right away. When I am about to make a decision, I tend not NOT go with “love at first sight”, because of this, my team did an extensive research around creating a website suitable for creating a great learning experience for members.<br \/>\nThere are so many options out there, and the one that we kept coming back to was Woffice for its simplicity, and also because it is, in a way, a system. We did not have to do much. All we had to do was to personalize it to our liking. It comes packaged with different features and plugins to help create a private learning, communicating and interacting environment suitable for exactly what we wanted to create for our members.<\/p>\n<h2>3. Has Woffice respected the expectations?<\/h2>\n<p>Since our members website is primarily for e-learning courses, we needed to add the LearnDash plugin. It so happens that Woffice comes with LearnDash integration &#8220;out of the box”. Our team did not like the LearnDash default look and feel. Woffice has styled our Learndash courses beautifully and with no effort and without spending thousands of dollars.<br \/>\nBecause Woffice also integrates with BuddyPress, this means, that not only we have our professional looking courses, we can also create a social learning environment for our members…..all out of the box.<br \/>\nWe can not have asked for more. Not only we have saved time, but countless hours of custom designing a members website we feel proud of.<\/p>\n<h2>4. What is the feature in Woffice that you definitely prefer and that helped more than any other one?<\/h2>\n<p>If in real estate all is about location, location and again location, for me and our team, when it come to an application, everything is about tech support, tech support and again tech support. Needles to say, Woffice is features rich and I have mentioned all we like about it above, but without their top-notch tech support team, we would have already gone elsewhere.<br \/>\nWoffice tech support team is reliable, prompt and present and it has gone way beyond the norm to make sure that any challenge we face, it is rapidly addressed.<\/p>\n<h2>5. What is the most useful plugin for your application?<\/h2>\n<p>As I told earlier, LearnDash is the most important plugin for me.<\/p>\n<h2>6. Is Woffice easy enough to use for a beginner?<\/h2>\n<p>Since Woffice is a what I call a “package” application with a whole set of solutions, it is great for beginners. Everything comes already “assembled” with easy to choose features. I think it will take hours and hours, a lot of money, effort and headaches for a beginner to get what Woffice offers out of the box. In a way, it was built for beginners and a delight to those more advance because it makes their job so easy.<\/p>\n<h2>7. There is a specific reason behind the decision to pick WordPress to build your web app?<\/h2>\n<p>Yes there is and that’s an easy one. WordPress is a very flexible platform. When I am traveling, oftentimes I come up with ideas that I want to see “live” now and rather than delegating that, I do it right there. WordPress, being so flexible, allows me to do that. It has thousands and thousands of plugins which help you accomplish virtually anything you want on a website. Another thing is the ability to have a professional website along with blogging capabilities built in. WordPress is that and more.<\/p>\n<h2>8. Before than you go, is there something that you would say to the Alkaweb team or to their customers?<\/h2>\n<p>To the Alkaweb team: Congratulations! You have built a masterpiece that is allowing organizations like mine, to create a custom-private-website in no time while being supported by your top-notch tech team.<br \/>\nTo future customers, well, waste no time, we already went through the pain doing the research for you, now all you have to do is to create your pages!!!!<\/p>\n<h2>Conclusion<\/h2>\n<p>Here&#8217;s Antonio again. Well, what I can say? Thank you so much Edward for your kind words,  I hope that Woffice will continue to satisfy you.<br \/>\nTo you dear reader, I hope you enjoyed the story of Edward, if you would like to be the next one, or you want share any thought with us, just let me know below.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Finally, we have a second story for our set of customer stories (if you missed the first one, you can find it here). This time is the turn of Edward A. Rodriguez, an entrepreneur from Florida (USA). Edward is an international speaker and coach [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":359,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7,13],"tags":[12],"_links":{"self":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/349"}],"collection":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/comments?post=349"}],"version-history":[{"count":1,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/349\/revisions"}],"predecessor-version":[{"id":5673,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/posts\/349\/revisions\/5673"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/media\/359"}],"wp:attachment":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/media?parent=349"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/categories?post=349"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/tags?post=349"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}