{"id":5050,"date":"2021-03-18T13:20:56","date_gmt":"2021-03-18T13:20:56","guid":{"rendered":"https:\/\/woffice.io\/?page_id=5050"},"modified":"2021-08-19T07:29:31","modified_gmt":"2021-08-19T07:29:31","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/woffice.io\/privacy-policy\/","title":{"rendered":"Privacy policy"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"5050\" class=\"elementor elementor-5050\" data-elementor-settings=\"[]\">\n\t\t\t\t\t\t<div class=\"elementor-inner\">\n\t\t\t\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-6f01cc17 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"6f01cc17\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-793d1d83\" data-id=\"793d1d83\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-7fae263 elementor-widget elementor-widget-text-editor\" data-id=\"7fae263\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<h4>Licensing<\/h4>\n<p>Woffice themes and plugins, unless otherwise stated, are licensed under the <a href=\"https:\/\/www.gnu.org\/licenses\/gpl.html\" target=\"_blank\" rel=\"noopener\">GNU General Public License<\/a>&nbsp;version 2.0 or later.<\/p>\n<h4>Warranty<\/h4>\n<p>Plugins and themes sold and distributed by Woffice are done so in the hope that they will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.<\/p>\n<p>Due to the number and variety of plugins and server configurations is innumerable, we cannot guarantee that the plugin will function with all third-party plugins, themes or browsers of any kind. We do not assume responsibility and will not be held responsible for any conflicts or compatibility issues that may occur due to third-party software. We assume no responsibility for any data loss as a result of installing or using Woffice products. Should conflicts occur with third-party software, we may provide support at our discretion.<\/p>\n<h4 id=\"refunds\">Refund Policy<\/h4>\n<p>We firmly believe in and stand behind our products, but we understand that it cannot work perfectly for in all cases. If you are unhappy with your purchase, or you have an issue that we are unable to resolve that makes the system unusable, we will be happy to consider offering a refund.<\/p>\n<p>Refunds will be offered at our sole discretion and must meet all of the following conditions fully:<\/p>\n<p>– You are within the first 30 days of the purchase of the plugin.<br>– You have attempted to resolve your issue(s) with our support team.<\/p>\n<p>No refunds will be granted after the first 30 days of the original purchase whatsoever. Issues caused by 3rd party plugins, themes or other software will not provide grounds for a refund.<\/p>\n<p>By purchasing plugin(s) from our site, you agree to this refund policy and relinquish any rights to subject it to any questions, judgment or legal actions.<\/p>\n<h4>Support<\/h4>\n<p>Woffice sells and distributes products “as is” and with no implied meaning that they will function exactly as you would like, or that they will be compatible with all third-party components and plugins.<\/p>\n<p>Support for plugins sold and distributed by Woffice is only available for those who have an active, paid license.<\/p>\n<p>Support for plugins sold by Woffice and distributed through Envato is only available for those who have an active support license for their originally purchased item on Envato.<\/p>\n<p>Support and updates for plugins are granted for one year after the original purchase based on the license you have purchased. After one year is completed, the purchaser must renew their license in order to continue receiving support and updates for the items purchased. For purchases that include an automatically renewing subscription, support will be provided for as long as the subscription remains active.<\/p>\n<p>Should any one of the following occur, Woffice will no longer be responsible for providing support for products:<\/p>\n<p>– Woffice or its parent company is purchased or bought out by another company.<br>– WordPress is no longer actively developed.<\/p>\n<p>Whilst we attempt to provide the best support possible for our plugins, we do not guarantee that any particular support query can, or will be answered to the extent, or within a timeframe that the inquirer is completely satisfied.<\/p>\n<h4>Plugin Updates<\/h4>\n<p>Automatic updates are available to license holders who have an active and valid subscription and license key. Automatic updates are available as long as the license key generated from the purchase is valid and active.<\/p>\n<h4>Plugin Delivery<\/h4>\n<p>After we have processed your payment successfully, you will receive an email with your order number and other purchase information. Your license key is available in your&nbsp;<a href=\"https:\/\/astoundify.com\/account\" target=\"_blank\" rel=\"noopener\">account area<\/a>&nbsp;along with your plugin downloads. You can download the plugin by logging into the account created for you when purchasing the plugin and clicking on the appropriate link.<\/p>\n<h4>Ownership<\/h4>\n<p>All plugins are property of Woffice. Claiming any type of intellectual or exclusive ownership rights of our products is strictly prohibited.<\/p>\n<p>Our plugins are provided “as is” without warranty of any kind, expressed or implied. We shall not be liable for any damages, including but not limited to, direct, indirect, special, incidental or consequential damages or losses that occur due to the use or inability to use our plugins.<\/p>\n<h4>Website &amp; Plugin Content<\/h4>\n<p>All content found on this site and throughout the plugin including images, documentation, support queries and any other information is property of Woffice and may not be redistributed without permission or consent.<\/p>\n<h4>Price Changes<\/h4>\n<p>Woffice reserves the right to modify, change, cancel or upgrade a plugin subscription and\/or license key without prior notice or consent. Prices of all products are subject to change without prior notice or consent.<\/p>\n<h4>License Agreement<\/h4>\n<p>By purchasing our product(s), you indicate and consent that you have read and agree to the Terms &amp; Conditions listed and detailed on this page. We reserve the right to change or modify the current Terms and Conditions without prior notice or consent.<\/p>\n<h4>Severability<\/h4>\n<p>If any part of this agreement is declared unenforceable or invalid, all remaining clauses in this agreement shall remain binding on the customer.<\/p>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Licensing Woffice themes and plugins, unless otherwise stated, are licensed under the GNU General Public License&nbsp;version 2.0 or later. Warranty Plugins and themes sold and distributed by Woffice are done so in the hope that they will be useful, but [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/pages\/5050"}],"collection":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/comments?post=5050"}],"version-history":[{"count":25,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/pages\/5050\/revisions"}],"predecessor-version":[{"id":16082,"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/pages\/5050\/revisions\/16082"}],"wp:attachment":[{"href":"https:\/\/woffice.io\/wp-json\/wp\/v2\/media?parent=5050"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}